<a href="https://colab.research.google.com/github/maronga/wk3-IP/blob/main/%22Moringa_Data_Science_Prep_W3_Independent_Project_2021_11_12_John_Maronga_python%22.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<font color="green">*To start working on this notebook, or any other notebook that we will use in the Moringa Data Science Course, we will need to save our own copy of it. We can do this by clicking File > Save a Copy in Drive. We will then be able to make edits to our own copy of this notebook.*</font>

# Pandas Basics II

## 1.0 Importing the Libraries to be used

In [4]:
# We'll begin by importing the pandas library
#
import pandas as pd

## 1.1 Loading our Datasets

In [22]:
# We'll then import the datasets to be used in the analysis and load them

cells_geo_description=pd.read_excel("/content/cells_geo_description.xlsx")
cells_geo_description

     Column name                                        Description  Format
0         VILLES                                               City  String
1         STATUS                                  In Service or not  String
2   LOCALISATION                                  in ABIDJAN or not  String
3     DECOUPZONE                                  Geographical Zone  String
4       ZONENAME                                       Name of Zone  String
5      LONGITUDE                                          Longitude   Float
6       LATITUDE                                           Latitude   Float
7         REGION                                             Region  String
8           AREA                                               Area  String
9        CELL_ID                                     ID of the cell  String
10     SITE_CODE  Site (there are several cells per site, severa...  String

In [21]:
cells_geo=pd.read_csv("/content/cells_geo.csv" ,delimiter=';')
cells_geo

      Unnamed: 0    VILLES      STATUS  ...          AREA     CELL_ID   SITE_CODE
0              0    ADJAME  In Service  ...           NaN  fbb2e75af3  0bb492ef17
1              1    ADJAME  In Service  ...           NaN  1502501d78  0bb492ef17
2              2    ADJAME  In Service  ...           NaN  0c2e182a0c  0bb492ef17
3              3   ASSINIE  In Service  ...           NaN  69bdfc69fd  8a1e6ce31f
4              4   ASSINIE  In Service  ...           NaN  7a1029d2ab  8a1e6ce31f
...          ...       ...         ...  ...           ...         ...         ...
3969        3969  ZUENOULA  In Service  ...  CENTRE NORTH  1cfc2d7ab1  f91ed8d2e9
3970        3970  ZUENOULA  In Service  ...  CENTRE NORTH  3ae1708153  f91ed8d2e9
3971        3971  ZUENOULA  In Service  ...  CENTRE NORTH  cb71f8a29c  61bee9c70c
3972        3972  ZUENOULA  In Service  ...  CENTRE NORTH  d4a6a0b645  61bee9c70c
3973        3973  ZUENOULA  In Service  ...  CENTRE NORTH  f9f3e42589  61bee9c70c

[3974 rows x 12 columns]

In [23]:
Telkom1=pd.read_csv("http://bit.ly/Telcom_dataset1")
Telkom1

     PRODUTC  VALUE               DATETIME  ... COUNTRY_B     CELL_ID     SITE_ID
0      Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1        sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2        sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3      Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4      Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv
...      ...    ...                    ...  ...       ...         ...         ...
4996     sms    100  2012-05-07 00:01:54.0  ...     OTHER  0c2371d9bc  1e751d08a4
4997   Voice      1  2012-05-07 00:01:54.0  ...     19e2e  5fb791cf56  65efe2bc62
4998   Voice      0  2012-05-07 00:01:54.0  ...     19e2e  7773627c12  9ef9616350
4999   Voice      0  2012-05-07 00:01:54.0  ...     19e2e  3f4af49d6c  969b8d0e39
5000   Voice      7  2012-05-07 00:01:54.0  ...     19e2e  6f4d9b77a5  ebfc58af70

[5001 rows x 10 columns]

In [24]:
Telkom2=pd.read_csv("http://bit.ly/Telcom_dataset2")
Telkom2

     PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0        sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1      Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2
2        sms      0  2012-05-07 23:04:06.0  ...     19e2e  +laSrk7g6q  +laSrk7g6q
3      Voice     37  2012-05-07 23:04:48.0  ...     19e2e  /xvRrCVKoQ  /xvRrCVKoQ
4        sms     25  2012-05-07 23:04:58.0  ...     19e2e  +bO+qkSonO  +bO+qkSonO
...      ...    ...                    ...  ...       ...         ...         ...
4996     sms      0  2012-05-08 00:01:53.0  ...     19e2e  896459aace  b7d00e59e4
4997     sms     25  2012-05-08 00:01:53.0  ...     19e2e  7e90b35166  211015b14d
4998     sms      0  2012-05-08 00:01:53.0  ...     19e2e  fe70e431df  c7ea989264
4999    data      0  2012-05-08 00:01:53.0  ...     OTHER  ffa6759bb2         NaN
5000   Voice      0  2012-05-08 00:01:53.0  ...     19e2e  8630058aca  b47a998a3e

[5001 rows x 10 columns]

In [25]:
Telkom3=pd.read_csv("http://bit.ly/Telcom_dataset2")
Telkom3

     PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0        sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1      Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2
2        sms      0  2012-05-07 23:04:06.0  ...     19e2e  +laSrk7g6q  +laSrk7g6q
3      Voice     37  2012-05-07 23:04:48.0  ...     19e2e  /xvRrCVKoQ  /xvRrCVKoQ
4        sms     25  2012-05-07 23:04:58.0  ...     19e2e  +bO+qkSonO  +bO+qkSonO
...      ...    ...                    ...  ...       ...         ...         ...
4996     sms      0  2012-05-08 00:01:53.0  ...     19e2e  896459aace  b7d00e59e4
4997     sms     25  2012-05-08 00:01:53.0  ...     19e2e  7e90b35166  211015b14d
4998     sms      0  2012-05-08 00:01:53.0  ...     19e2e  fe70e431df  c7ea989264
4999    data      0  2012-05-08 00:01:53.0  ...     OTHER  ffa6759bb2         NaN
5000   Voice      0  2012-05-08 00:01:53.0  ...     19e2e  8630058aca  b47a998a3e

[5001 rows x 10 columns]

## 1.2 Exploration

Before beginning to analyse the data, I'll first replace the column names to make it more readable.

In [36]:
#I'll first replace the column names of the cells geo with the ones from the 
#cells geo description table
cells_geo.rename(columns={"VILLES": "CITY", "LOCALISATION":"LOCATION",
                          "DECOUPZONE": "GEOGRAPHICAL_ZONE",
                          },inplace=True)
cells_geo

      Unnamed: 0      CITY      STATUS  ...          AREA     CELL_ID   SITE_CODE
0              0    ADJAME  In Service  ...           NaN  fbb2e75af3  0bb492ef17
1              1    ADJAME  In Service  ...           NaN  1502501d78  0bb492ef17
2              2    ADJAME  In Service  ...           NaN  0c2e182a0c  0bb492ef17
3              3   ASSINIE  In Service  ...           NaN  69bdfc69fd  8a1e6ce31f
4              4   ASSINIE  In Service  ...           NaN  7a1029d2ab  8a1e6ce31f
...          ...       ...         ...  ...           ...         ...         ...
3969        3969  ZUENOULA  In Service  ...  CENTRE NORTH  1cfc2d7ab1  f91ed8d2e9
3970        3970  ZUENOULA  In Service  ...  CENTRE NORTH  3ae1708153  f91ed8d2e9
3971        3971  ZUENOULA  In Service  ...  CENTRE NORTH  cb71f8a29c  61bee9c70c
3972        3972  ZUENOULA  In Service  ...  CENTRE NORTH  d4a6a0b645  61bee9c70c
3973        3973  ZUENOULA  In Service  ...  CENTRE NORTH  f9f3e42589  61bee9c70c

[3974 rows x 12 columns]

In [45]:
#Replace column names from data Telkom dataset 1 to match columns names from
#Dataset 1 and 2
Telkom1.rename(columns={'PRODUTC':'PRODUCT','DATETIME':'DATE_TIME',
                        'DW_A_NUMBER_INT':'DW_A_NUMBER', 'DW_B_NUMBER_INT':
                        'DW_B_NUMBER'},inplace=True)
Telkom1

     PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0      Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1        sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2        sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3      Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4      Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv
...      ...    ...                    ...  ...       ...         ...         ...
4996     sms    100  2012-05-07 00:01:54.0  ...     OTHER  0c2371d9bc  1e751d08a4
4997   Voice      1  2012-05-07 00:01:54.0  ...     19e2e  5fb791cf56  65efe2bc62
4998   Voice      0  2012-05-07 00:01:54.0  ...     19e2e  7773627c12  9ef9616350
4999   Voice      0  2012-05-07 00:01:54.0  ...     19e2e  3f4af49d6c  969b8d0e39
5000   Voice      7  2012-05-07 00:01:54.0  ...     19e2e  6f4d9b77a5  ebfc58af70

[5001 rows x 10 columns]

In [55]:
#Merge the three Telkom Dataset using concat
Telkom=[Telkom1,Telkom2,Telkom3]
Telkom_merged=pd.concat(Telkom)
Telkom_merged

     PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0      Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1        sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2        sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3      Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4      Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv
...      ...    ...                    ...  ...       ...         ...         ...
4996     sms      0  2012-05-08 00:01:53.0  ...     19e2e  896459aace  b7d00e59e4
4997     sms     25  2012-05-08 00:01:53.0  ...     19e2e  7e90b35166  211015b14d
4998     sms      0  2012-05-08 00:01:53.0  ...     19e2e  fe70e431df  c7ea989264
4999    data      0  2012-05-08 00:01:53.0  ...     OTHER  ffa6759bb2         NaN
5000   Voice      0  2012-05-08 00:01:53.0  ...     19e2e  8630058aca  b47a998a3e

[15003 rows x 10 columns]

In [54]:
cells_geo.merge = cells_geo.merge(Telkom_merged, how='right', on='CELL_ID')
cells_geo.merge

TypeError: ignored

In [ ]:
# Example 3
# Finding also Unique Values In the Pandas Dataframes
import numpy as np

# First creating a Dataframe from a Dictionary
raw_data = {'regiment': ['51st', '29th', '2nd', '19th', '12th', '101st', '90th', '30th', '193th', '1st', '94th', '91th'], 
            'trucks': ['MAZ-7310', np.nan, 'MAZ-7310', 'MAZ-7310', 'Tatra 810', 'Tatra 810', 'Tatra 810', 'Tatra 810', 'ZIS-150', 'Tatra 810', 'ZIS-150', 'ZIS-150'],
            'tanks': ['Merkava Mark 4', 'Merkava Mark 4', 'Merkava Mark 4', 'Leopard 2A6M', 'Leopard 2A6M', 'Leopard 2A6M', 'Arjun MBT', 'Leopard 2A6M', 'Arjun MBT', 'Arjun MBT', 'Arjun MBT', 'Arjun MBT'],
            'aircraft': ['none', 'none', 'none', 'Harbin Z-9', 'Harbin Z-9', 'none', 'Harbin Z-9', 'SH-60B Seahawk', 'SH-60B Seahawk', 'SH-60B Seahawk', 'SH-60B Seahawk', 'SH-60B Seahawk']}
df = pd.DataFrame(raw_data, columns = ['regiment', 'trucks', 'tanks', 'aircraft'])
df

# Viewing the top few rows
# Uncomment the line below after running previous lines
# df.head()

# We can create a list of unique values by turning the pandas column into a set
# Uncomment the line below after running previous lines
# list(set(df.trucks))

# Here's another way of creating a list of unique values in df.trucks
# Uncomment the line below after running previous lines
# list(df['trucks'].unique())

In [ ]:
# Example 4
# listing Unique Values In A pandas Column
#

# Create an example dataframe
data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'year': [2012, 2012, 2013, 2014, 2014], 
        'reports': [4, 24, 31, 2, 3]}
df = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df

# List unique values in the df['name'] column
# Uncomment the line below after running previous lines
# df.name.unique()

In [ ]:
# Example 5
# Grouping Rows In pandas
# 

# Creating a Dataframe
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}
df = pd.DataFrame(raw_data, columns = ['regiment', 'company', 'name', 'preTestScore', 'postTestScore'])
df

# Creating a grouping object. In other words, create an object that
# represents that particular grouping. In this case we group
# pre-test scores by the regiment.
# Uncomment the line below after running previous lines
# regiment_preScore = df['preTestScore'].groupby(df['regiment'])

# Displaying the mean value of the each regiment's pre-test score
# Uncomment the line below after running previous lines
# regiment_preScore.mean()

### <font color="green"> 1.2 Challenges</font>

In [ ]:
# Challenge 1
# Let us view the following Dataframe upon creation from the following Dictionary
#
data = {'name': ['Alice', 'Robert', 'Charles', 'David', 'Eric'],
        'year of joining': [2014, 2015, 2013, 2014, 2013],
        'salary': [40000, 25000, 35000, 200000, 30000]}
df = pd.DataFrame(data, index = ['I&M', 'I&M', 'KCB', 'KCB', 'KCB'])
df

# Let us view salary column
df[("salary")]

# We would like to compare the name and the salary columns
df[["name", "salary"]]

# Let's view the first three records of the dataframe
df[0:3]

# Which employee(s) earn(s) a salary of more than 30000
filt=df['salary']>30000
df[filt]

# Which employee(s) earn(s) a salary of less than 30000 and joined before 2015
new=(df["salary"]<30000) & (df["year of joining"]<2015)
df[new]

Empty DataFrame
Columns: [name, year of joining, salary]
Index: []

In [ ]:
# Challenge 2
# Find out the person with greatest age from the Dataframe that you will create
# upon creating the Dictionary below
# 

# Create a DataFrame
df = {'Name':['Audrey','Kwasi','Parul','Lohinee','James','Catherine',
'Val','Robert','Alex','Alisa','Murkomen','Judy'],
'Age':[26,24,23,22,23,24,26,24,22,23,24,24],
'Score':[85,63,55,74,31,77,85,63,42,62,89,77]}

dy=pd.DataFrame(df)
dy
max_val = dy[["Name","Age"]].max() 
max_val

Name    Val
Age      26
dtype: object

In [ ]:
# Challenge 3
# Get the unique values of the continent column from the Dataset below
# url = http://bit.ly/FiveYearData
#
dr=pd.read_csv("/content/five year data.csv")
dr
#a = dr['continent'].unique()
#a

          country  year         pop continent  lifeExp   gdpPercap
0     Afghanistan  1952   8425333.0      Asia   28.801  779.445314
1     Afghanistan  1957   9240934.0      Asia   30.332  820.853030
2     Afghanistan  1962  10267083.0      Asia   31.997  853.100710
3     Afghanistan  1967  11537966.0      Asia   34.020  836.197138
4     Afghanistan  1972  13079460.0      Asia   36.088  739.981106
...           ...   ...         ...       ...      ...         ...
1699     Zimbabwe  1987   9216418.0    Africa   62.351  706.157306
1700     Zimbabwe  1992  10704340.0    Africa   60.377  693.420786
1701     Zimbabwe  1997  11404948.0    Africa   46.809  792.449960
1702     Zimbabwe  2002  11926563.0    Africa   39.989  672.038623
1703     Zimbabwe  2007  12311143.0    Africa   43.487  469.709298

[1704 rows x 6 columns]

In [ ]:
# Challenge 4
# How many countries are there in the dataset on challenge 3
# 
len(dr["country"])

1704

In [ ]:
# Challenge 5
# What is the average number of goals per teams from the dictionary below
# 

# Creating our dataframe
football = {'Team':['Arsenal', 'Manchester United', 'Arsenal', 
                   'Arsenal', 'Chelsea', 'Manchester United', 
                   'Manchester United', 'Chelsea', 'Chelsea', 'Chelsea'],     
           'Player':['Ozil', 'Pogba', 'Lucas', 'Aubameyang', 
                       'Hazard', 'Mata', 'Lukaku', 'Morata',  
                                         'Giroud', 'Kante'],                          
           'Goals':[6, 4, 7, 5, 10, 3, 1, 6, 3, 4]} 

di=pd.DataFrame(football)
di
di["Goals"].mean()

4.9

## 1.3 Selecting and Sorting

In [ ]:
# Example 1
# In this section, we will select and sort our dataframes
# We will start off by ranking Rows Of Pandas Dataframes as shown 
#

# Creating dataframe
data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'year': [2012, 2012, 2013, 2014, 2014], 
        'reports': [4, 24, 31, 2, 3],
        'coverage': [25, 94, 57, 62, 70]}
df = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df

# Creating a new column that is the rank of the value of coverage in ascending order
# Uncomment the line below after running previous lines
df['coverageRanked'] = df['coverage'].rank(ascending=1)
df

In [ ]:
# Example 2
# Next, we will Select Rows When Columns that Contain Certain Values
# 

# Create an example dataframe
data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'year': [2012, 2012, 2013, 2014, 2014], 
        'reports': [4, 24, 31, 2, 3]}
df = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df

# Get rows where column has certain values
# Uncomment the line below after running previous lines
# value_list = ['Tina', 'Molly', 'Jason']
# df[df.name.isin(value_list)]

# Get rows where column doesn't have certain values
# Uncomment the line below after running previous lines
# df[~df.name.isin(value_list)]

In [ ]:
# Example 3
# Then, Select Rows With A Certain Value

# Create an example dataframe
data = {'name': ['Jason', 'Molly'], 
        'country': [['Syria', 'Lebanon'],['Spain', 'Morocco']]}
df = pd.DataFrame(data)
df

# Uncomment the line below after running previous lines
# df[df['country'].map(lambda country: 'Syria' in country)]

In [ ]:
# Example 4
# Select Rows With Multiple Filters
#

# Create an example dataframe
data = {'name': ['A', 'B', 'C', 'D', 'E'], 
        'score': [1,2,3,4,5]}
df = pd.DataFrame(data)
df

# Select rows of the dataframe where df.score is greater than 1 and less and 5
# Uncomment the line below after running previous lines
# df[(df['score'] > 1) & (df['score'] < 5)]

In [ ]:
# Example 5
# Selecting DataFrame Rows Based On Conditions
# 

# import numpy
import numpy as np

# Creating a dataframe
raw_data = {'first_name': ['Jason', 'Molly', np.nan, np.nan, np.nan], 
        'nationality': ['USA', 'USA', 'France', 'UK', 'UK'], 
        'age': [42, 52, 36, 24, 70]}
df = pd.DataFrame(raw_data, columns = ['first_name', 'nationality', 'age'])
df

# Method 1: Using Boolean Variables
# Create variable with TRUE if nationality is USA
# Uncomment the line below after running previous lines
# american = df['nationality'] == "USA"

# Create variable with TRUE if age is greater than 50
# Uncomment the line below after running previous lines
# elderly = df['age'] > 50

# Select all cases where nationality is USA and age is greater than 50
# Uncomment the line below after running previous lines 
# df[american & elderly]


# Method 2: Using variable attributes
# Select all cases where the first name is not missing and nationality is USA
# Uncomment the line below after running previous lines
# df[df['first_name'].notnull() & (df['nationality'] == "USA")]

In [ ]:
# Example 6
# Sorting Rows In pandas Dataframes
# 

# Creating a Dataframe to work with
data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'year': [2012, 2012, 2013, 2014, 2014], 
        'reports': [1, 2, 1, 2, 3],
        'coverage': [2, 2, 3, 3, 3]}
df = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df

# Sort the dataframe’s rows by reports, in descending order
# Uncomment the line below after running previous lines
# df.sort_values(by='reports', ascending=0)

# Sort the dataframe’s rows by coverage and then by reports, in ascending order
# Uncomment the line below after running previous lines
# df.sort_values(by=['coverage', 'reports'])

### <font color="green">1.3 Challenges</font>

In [ ]:
# Challenge 1
# Create a new column ranking the following cars by price 
# 

Cars = {'Brand': ['Honda Civic', 'Toyota Corolla', 'Ford Focus', 'Audi A4'],
        'Price': [22000, 25000, 27000, 35000],
        'Year': [2015, 2013, 2018, 2018]}

dp=pd.DataFrame(Cars)
dp
dp.sort_values(by='Price', ascending=False)
dp

            Brand  Price  Year
0     Honda Civic  22000  2015
1  Toyota Corolla  25000  2013
2      Ford Focus  27000  2018
3         Audi A4  35000  2018

In [ ]:
# Challenge 2
# Let's get the rows when the column contains certain values
#

data = {'model': ['Lisa', 'Lisa 2', 'Macintosh 128K', 'Macintosh 512K'],
        'launched': [1983, 1984, 1984, 1984],
        'discontinued': [1986, 1985, 1984, 1986]}
columns = ['model', 'launched', 'discontinued']

# Get the rows where the column model contains Lisa
de=pd.DataFrame(data)
de
new=(de["model"]=="Lisa")
de[new]
# Get the rows where the column model does not contain Macintosh 128K
new=(de["model"]=="Macintosh 128K")
de[~new]

            model  launched  discontinued
0            Lisa      1983          1986
1          Lisa 2      1984          1985
3  Macintosh 512K      1984          1986

In [ ]:
# Challenge 3
# Select the rows with the value blue or yellow from the Dataframe below
#
data = {'name': ['Willam', 'Alex', 'Oliech', 'Julie'],
'age': [20, 19, 22, 21],
'favorite_color': ['blue', 'blue', 'yellow', "green"],
'grade': [88, 92, 95, 70]}

dl=pd.DataFrame(data)
dl
#dl.loc[dl["favorite_color"]=="blue"]
import re 
dl.loc[dl["favorite_color"].str.contains('blue|yellow', regex=True)]

     name  age favorite_color  grade
0  Willam   20           blue     88
1    Alex   19           blue     92
2  Oliech   22         yellow     95

In [ ]:
# Challenge 4
# Using the following dataset, which counties have less than 50,000 households?
url = "http://bit.ly/KeHouseholds1"
# This dataset shows the distribution of households based on their age group, gender and household head.
#
df = pd.read_csv("/content/Percentage_Distribution_of_Households_by_Age_and_Sex_of_Household_Head.csv")
df
df.loc[df["Number_of_households"]<50000]

             County  ... OBJECTID
1             Kwale  ...        1
3       Tana Rriver  ...        3
4              Lamu  ...        4
5      Taita Taveta  ...        5
6          Marsabit  ...        6
8         Nyandarua  ...        8
10        Kirinyaga  ...       10
13           Isiolo  ...       13
15          Tharaka  ...       15
16             Embu  ...       16
20          Garissa  ...       20
21            Wajir  ...       21
22          Mandera  ...       22
29          Nyamira  ...       29
30          Turkana  ...       30
31       West Pokot  ...       31
32          Samburu  ...       32
34          Baringo  ...       34
36  Elgeyo-Marakwet  ...       36
37            Nandi  ...       37
38         Laikipia  ...       38
42          Kericho  ...       42
45           Vihiga  ...       45
57      Tana Rriver  ...       57
58             Lamu  ...       58
59     Taita Taveta  ...       59
60         Marsabit  ...       60
61           Isiolo  ...       61
79          Samburu  ...       79

[29 rows x 9 columns]

In [ ]:
# Challenge 5
# Using the following dataset, Which top 3 municipalities have the highest population?
url = "http://bit.ly/KePopulationDistribution1"
# 
OUR CODE GOES HERE

In [ ]:
# Challenge 6
# Using the dataset given in challenge 5, sort the rows by the total core urban population 
#
OUR CODE GOES HERE

In [ ]:
# Challenge 7
# Using the following dataset, Which quarter experienced the highest no. of visitors after 2007
# url = http://bit.ly/VisitorsToKenya
# This dataset comprises of visitor arrivals and departures Between 1991 up to 2014 by the purpose of visiting Kenya
# 
# OUR CODE GOES HERE
import pandas as pd

tst  = pd.read_csv("http://bit.ly/VisitorsToKenya", delimiter="\s+", )
tst.head()

ParserError: ignored

## 1.4 Cleaning

In [ ]:
# Example 1
# Assign a new column to a Pandas DataFrame
# 

# Create empty dataframe
df = pd.DataFrame() 
df['name'] = ['John', 'Steve', 'Sarah'] 
df
 
# Assign a new column to df called 'age' with a list of ages
# Uncomment the line below after running previous lines
# df.assign(age = [31, 32, 19])

In [ ]:
# Example 2
# Lowercase column names in Pandas Dataframe
#

# Let's first set ipython's max row display
pd.set_option('display.max_row', 1000)

# Let's first set iPython's max column width to 50
pd.set_option('display.max_columns', 50)

# Create an example dataframe
data = {'NAME': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'YEAR': [2012, 2012, 2013, 2014, 2014], 
        'REPORTS': [4, 24, 31, 2, 3]}
df = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df
 
# Map the lowering function to all column names
# Uncomment the line below after running previous lines
# df.columns = map(str.lower, df.columns)
# df

In [ ]:
# Example 3
# While doing data analysis, finding duplicates in your data is very important. 
# Delete duplicates in pandas
#


# Create dataframe with duplicates
raw_data = {'first_name': ['Jason', 'Jason', 'Jason','Tina', 'Jake', 'Amy'], 
        'last_name': ['Miller', 'Miller', 'Miller','Ali', 'Milner', 'Cooze'], 
        'age': [42, 42, 1111111, 36, 24, 73], 
        'preTestScore': [4, 4, 4, 31, 2, 3],
        'postTestScore': [25, 25, 25, 57, 62, 70]}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'preTestScore', 'postTestScore'])
df

# Identify which observations are duplicates
# Uncomment the line below after running previous lines
# df.duplicated()

# Drop duplicates
# Uncomment the line below after running previous lines
# df.drop_duplicates()

# Drop duplicates in a specific column
# Uncomment the line below after running previous lines
# df.drop_duplicates(['first_name'], keep='last')

In [ ]:
# Example 4
# Another crucial part of data analysis is finding missing data and deleting them. Let's lookd at how to deal with missing data 
# Missing data in pandas Dataframes
#

raw_data = {'first_name': ['Jason', np.nan, 'Tina', 'Jake', 'Amy'], 
        'last_name': ['Miller', np.nan, 'Ali', 'Milner', 'Cooze'], 
        'age': [42, np.nan, 36, 24, 73], 
        'sex': ['m', np.nan, 'f', 'm', 'f'], 
        'preTestScore': [4, np.nan, np.nan, 2, 3],
        'postTestScore': [25, np.nan, np.nan, 62, 70]}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'sex', 'preTestScore', 'postTestScore'])
df

# Checking if there are missing values in your data
# Uncomment the line below after running previous lines
# df.isnull() #returns a boolean value for all the cells that have Nan  value


# Drop missing observations
# Uncomment the line below after running previous lines
# df_no_missing = df.dropna()
# df_no_missing

# Drop rows where all cells in that row is NA
# Uncomment the line below after running previous lines
# df_cleaned = df.dropna(how='all')
# df_cleaned

# Drop column if they only contain missing values
# Uncomment the line below after running previous lines
# df.dropna(axis=1, how='all')

# Drop rows that contain less than five observations
# Uncomment the line below after running previous lines
# df.dropna(thresh=5)

# Fill in missing data with zeros
# Uncomment the line below after running previous lines
# df.fillna(0)

# Fill in missing in preTestScore with the mean value of preTestScore
# Uncomment the line below after running previous lines
# df["preTestScore"].fillna(df["preTestScore"].mean(), inplace=True)
# df

In [ ]:
# Example 5
# Dropping rows and columns in pandas Dataframe
#

# Create a dataframe
data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'year': [2012, 2012, 2013, 2014, 2014], 
        'reports': [4, 24, 31, 2, 3]}
df = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df

# Drop an observation (row)
# Uncomment the line below after running previous lines
# df.drop(['Cochice', 'Pima'])

# Drop a variable (column). 
# NB: axis=1 denotes that we are referring to a column, not a row
# Uncomment the line below after running previous lines
# df.drop('reports', axis=1)

# Drop a row if it contains a certain value (in this case, “Tina”)
# Create a new dataframe called df that includes all rows where 
# the value of a cell in the name column does not equal “Tina”
# Uncomment the line below after running previous lines
# df[df.name != 'Tina']

### <font color="green">1.4 Challenges</font>

In [ ]:
# Challenge 1
# Let's assign the new column address to the created dataframe frow the dictionary below
#

# Define a dictionary containing Students data 
finals = {'Name': ['Robert', 'Thomas', 'Susan', 'Irene'], 
        'Height': [5.1, 6.2, 5.1, 5.2], 
        'Qualification': ['Msc', 'MA', 'Msc', 'Msc']} 
address = ['UoN', 'Strathmore', 'JKUAT', 'JKUAT'] 

OUR CODE GOES HERE

In [ ]:
# Challenge 2
# Let us lowercase the column names in the following dataset
# url = http://bit.ly/KePopulationDistribution1
#
OUR CODE GOES HERE

In [ ]:
# Challenge 3
# Delete duplicate values from the dictionary below
# 

# First creating the following DataFrame
d = {
    'Name':['Alice','Brian','Rhoda','Pauline','Julius','Catherine',
            'Alice','Brian','Kellen','Alice','Alex','Yvonne'],
    'Age':[26,24,23,22,23,24,26,24,22,23,24,24],
    'Score':[85,63,55,74,31,77,85,63,42,62,89,77]}

OUR CODE GOES HERE

In [ ]:
# Challenge 4
# Drop the missing columns 
#

# Creating our DataFrame
df = {'Name':['George','Andrea','micheal','maggie','Ravi','Xien','Jalpa',np.nan],
    'State':['Arizona','Georgia','Newyork','Indiana','Florida','California',np.nan,np.nan],
    'Gender':["M","F","M","F","M","M",np.nan,np.nan],      
    'Score':[63,48,56,75,np.nan,77,np.nan,np.nan]}

# Drop all rows that have any NaN (missing) values
OUR CODE GOES HERE

# Drop records which have more than 2 missing values
OUR CODE GOES HERE

In [ ]:
# Challenge 5
# Using the following dataset given, get the records which contain missing observations,
# then make a decision which records to delete based on the context.
# Act on the decision taken (i.e. Drop/Not dropping) and state your decision below
# url = http://bit.ly/KePopulationDistribution1
# 

OUR CODE GOES HERE

# Decision Taken:
# YOUR DECISION GOES HERE
#

## 1.5 Analysis

In [ ]:
# Example 1
# Descriptive Statistics For pandas Dataframe
#

data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'age': [42, 52, 36, 24, 73], 
        'preTestScore': [4, 24, 31, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70]}
df = pd.DataFrame(data, columns = ['name', 'age', 'preTestScore', 'postTestScore'])
df


# The sum of all the ages
# Uncomment the line below after running previous lines
# df['age'].sum()

# Mean preTestScore
# Uncomment the line below after running previous lines
# df['preTestScore'].mean()

# Cumulative sum of preTestScores, moving from the rows from the top
# Uncomment the line below after running previous lines
# df['preTestScore'].cumsum()

# Summary statistics on preTestScore
# Uncomment the line below after running previous lines.
# The output for this summary will be; the total number of rows there is in the column, the mean value for the data in the column, 
# the standard deviation of the data , min and max values of the data, the 25th 50th 75th percentile of the data.
df['preTestScore'].describe()

# Count the number of non-NA values
# Uncomment the line below after running previous lines
# df['preTestScore'].count()

# Minimum value of preTestScore
# Uncomment the line below after running previous lines
# df['preTestScore'].min()

# Maximum value of preTestScore
# Uncomment the line below after running previous lines
# df['preTestScore'].max()

# Median value of preTestScore
# Uncomment the line below after running previous lines
# df['preTestScore'].median()

# Sample variance of preTestScore values
# Uncomment the line below after running previous lines
# df['preTestScore'].var()

# Sample standard deviation of preTestScore values
# Uncomment the line below after running previous lines
# df['preTestScore'].std()

# Skewness of preTestScore values
# Uncomment the line below after running previous lines
# df['preTestScore'].skew()

# Kurtosis of preTestScore values
# Uncomment the line below after running previous lines
# df['preTestScore'].kurt()

# Correlation Matrix Of Values
# A correlation matrix is a table showing correlation coefficents of different variables. In other words, it shows how different columns corelate to each other. The coefficients range between -1 and 1.
# The closer the values are to -1 indicates that the variables do not correlate while the closer the values are to 1 indicates that the values have a high correlation.
# A correlation matrix is very important when we are trying to understand our data as it serves as input for advanced analysis.
# Uncomment the line below after running previous lines
# df.corr()

In [ ]:
# Example 2
# Apply Operations To Groups In Pandas
#

# Create dataframe
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}
df = pd.DataFrame(raw_data, columns = ['regiment', 'company', 'name', 'preTestScore', 'postTestScore'])
df

# Create a groupby variable that groups preTestScores by regiment
# Uncomment the line below after running previous lines
# groupby_regiment = df['preTestScore'].groupby(df['regiment'])
# groupby_regiment

# Descriptive statistics by group
# Uncomment the line below after running previous lines
# df['preTestScore'].groupby(df['regiment']).describe()

# Mean of each regiment’s preTestScore
# Uncomment the line below after running previous lines
# groupby_regiment.mean()

# Mean preTestScores grouped by regiment and company
# Uncomment the line below after running previous lines
# df['preTestScore'].groupby([df['regiment'], df['company']]).mean()

# Number of observations in each regiment and company
# Uncomment the line below after running previous lines
# df.groupby(['regiment', 'company']).size()

In [ ]:
# Example 3
# Random Sampling Dataframe
# 

raw_data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'], 
        'age': [42, 52, 36, 24, 73], 
        'preTestScore': [4, 24, 31, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70]}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'preTestScore', 'postTestScore'])
df

# Select a random subset of 2 without replacement
# Uncomment the line below after running previous lines
# df.take(np.random.permutation(len(df))[:2])

In [ ]:
# Example 4
# Pivot Tables In pandas
#

# Create dataframe
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'TestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3]}
df = pd.DataFrame(raw_data, columns = ['regiment', 'company', 'TestScore'])
df

# Create a pivot table of group means, by company and regiment
# Uncomment the line below after running previous lines
# pd.pivot_table(df, index=['regiment','company'], aggfunc='mean')

# Create a pivot table of group score counts, by company and regiments
# Uncomment the line below after running previous lines
# df.pivot_table(index=['regiment','company'], aggfunc='count')

### <font color="green">1.5 Challenges</font>

In [ ]:
# Challenge 1
# Using the given dataset, calculate the descriptive statistics of the total population
# url = http://bit.ly/KePopulationDistribution1
#

# The total population in Kenya
OUR CODE GOES HERE

# The average population per urban center 
 

# The total urban population fo the cities 
 

# Summary statistics on total population
 

# Count the number municipalities in the country


# Which municipality/city/other/town is the most sparcely populated 


# Which municipality/city/other/town is the most densely populated 

# Median value of the total population 


# Sample variance of the total population


# Sample standard deviation of the total population


# Correlation of the variables in the given dataset

In [ ]:
# Challenge 2
# Using the given dictionary below, find out the mean and median of the points during the Years
# 

kenyan_premier_league = {'Team': ['Gor Mahia', 'AFC', 'Mathare', 'Ushuru', 'Kariobangi Sharks',
   'Tusker', 'Bandari', 'Mumias', 'Thika Utd', 'Kakamega', 'Nakuru Utd', 'Kibera Utd'], 
   'Year': [2018, 2019, 2017, 2019, 2017, 2019, 2016, 2017, 2016, 2018, 2019, 2017],
   'Points':[87, 78, 86, 67, 74, 81, 75, 78, 69, 70, 80, 69]}

OUR CODE GOES HERE

In [ ]:
# Challenge 3
# Randomly select a municipality without replacement from the following dataset
# url = http://bit.ly/KePopulationDistribution1
# 
OUR CODE GOES HERE

In [ ]:
# Challenge 4
# From the given dataset, create a pivot table of sum total population by District 
#
OUR CODE GOES HERE

In [ ]:
# Challenge 5
# From the given dataset, create a pivot table of sum total population by District 
# url = http://bit.ly/KePopulationDistribution1
# 
OUR CODE GOES HERE